Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac` workspace: `default`
---

### 1. dir: `.` workspace: `default`
**Plan Error**
```
running 'sh -c' 'terragrunt plan -out=$PLANFILE' in '/home/atlantis/data/repos/eitch-consulting/demo-atlantis-terragrunt/3/default': exit status 1: running "terragrunt plan -out=$PLANFILE" in "/home/atlantis/data/repos/eitch-consulting/demo-atlantis-terragrunt/3/default": 
22:33:56.949 INFO   Terragrunt Cache server is listening on 127.0.0.1:40095
22:33:56.949 INFO   Start Terragrunt Cache server
22:33:56.950 INFO   Shutting down Terragrunt Cache server...
22:33:56.950 INFO   Terragrunt Cache server stopped
22:33:56.950 ERROR  stat ./terragrunt.hcl: no such file or directory
22:33:56.950 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac` workspace: `default`
<details><summary>Show Output</summary>

```diff
22:33:57.831 INFO   Terragrunt Cache server is listening on 127.0.0.1:43781
22:33:57.831 INFO   Start Terragrunt Cache server
22:33:57.913 INFO   Downloading Terraform configurations from tfr:///terraform-google-modules/cloud-storage/google?version=10.0.2 into ./.terragrunt-cache/9x3w_LOTKsMwmDQL0neBiRsn9qE/nMzp8HmAhZY0B79QE6g812IfclE
22:33:58.881 INFO   Caching terraform providers for ./.terragrunt-cache/9x3w_LOTKsMwmDQL0neBiRsn9qE/nMzp8HmAhZY0B79QE6g812IfclE/modules/simple_bucket
22:34:00.959 INFO   Cached registry.terraform.io/hashicorp/google v6.37.0 (signed by HashiCorp)
22:34:01.089 INFO   terraform: Initializing the backend...
22:34:01.333 INFO   terraform: Initializing modules...
22:34:01.337 INFO   terraform: Initializing provider plugins...
22:34:01.337 INFO   terraform: - Reusing previous version of hashicorp/google from the dependency lock file
22:34:01.345 INFO   terraform: - Installing hashicorp/google v6.37.0...
22:34:01.527 INFO   terraform: - Installed hashicorp/google v6.37.0 (unauthenticated)
22:34:01.527 INFO   terraform: Terraform has been successfully initialized!
22:34:01.527 INFO   terraform: 
22:34:01.527 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
22:34:01.527 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
22:34:01.527 INFO   terraform: should now work.
22:34:01.527 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
22:34:01.527 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
22:34:01.527 INFO   terraform: commands will detect it and remind you to do so if necessary.
22:34:02.838 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Reading...
22:34:02.911 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-538311360123@gs-project-accounts.iam.gserviceaccount.com]
22:34:02.955 STDOUT terraform: Terraform used the selected providers to generate the following execution
22:34:02.955 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
22:34:02.955 STDOUT terraform:   + create
22:34:02.955 STDOUT terraform: Terraform will perform the following actions:
22:34:02.955 STDOUT terraform:   # google_storage_bucket.bucket will be created
22:34:02.955 STDOUT terraform:   + resource "google_storage_bucket" "bucket" {
22:34:02.955 STDOUT terraform:       + effective_labels            = {
22:34:02.955 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
22:34:02.955 STDOUT terraform:           + "owner"                      = "infrastructure"
22:34:02.955 STDOUT terraform:           + "service-name"               = "testing-iac"
22:34:02.955 STDOUT terraform:         }
22:34:02.955 STDOUT terraform:       + force_destroy               = true
22:34:02.955 STDOUT terraform:       + id                          = (known after apply)
22:34:02.955 STDOUT terraform:       + labels                      = {
22:34:02.955 STDOUT terraform:           + "owner"        = "infrastructure"
22:34:02.955 STDOUT terraform:           + "service-name" = "testing-iac"
22:34:02.955 STDOUT terraform:         }
22:34:02.955 STDOUT terraform:       + location                    = "US-CENTRAL1"
22:34:02.955 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
22:34:02.955 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
22:34:02.956 STDOUT terraform:       + project_number              = (known after apply)
22:34:02.956 STDOUT terraform:       + public_access_prevention    = "inherited"
22:34:02.956 STDOUT terraform:       + rpo                         = (known after apply)
22:34:02.956 STDOUT terraform:       + self_link                   = (known after apply)
22:34:02.956 STDOUT terraform:       + storage_class               = "REGIONAL"
22:34:02.956 STDOUT terraform:       + terraform_labels            = {
22:34:02.956 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
22:34:02.956 STDOUT terraform:           + "owner"                      = "infrastructure"
22:34:02.956 STDOUT terraform:           + "service-name"               = "testing-iac"
22:34:02.956 STDOUT terraform:         }
22:34:02.956 STDOUT terraform:       + time_created                = (known after apply)
22:34:02.956 STDOUT terraform:       + uniform_bucket_level_access = true
22:34:02.956 STDOUT terraform:       + updated                     = (known after apply)
22:34:02.956 STDOUT terraform:       + url                         = (known after apply)
22:34:02.956 STDOUT terraform:       + autoclass {
22:34:02.956 STDOUT terraform:           + enabled                = false
22:34:02.956 STDOUT terraform:           + terminal_storage_class = (known after apply)
22:34:02.956 STDOUT terraform:         }
22:34:02.956 STDOUT terraform:       + soft_delete_policy {
22:34:02.956 STDOUT terraform:           + effective_time             = (known after apply)
22:34:02.957 STDOUT terraform:           + retention_duration_seconds = 604800
22:34:02.957 STDOUT terraform:         }
22:34:02.957 STDOUT terraform:       + versioning {
22:34:02.957 STDOUT terraform:           + enabled = false
22:34:02.957 STDOUT terraform:         }
22:34:02.957 STDOUT terraform:       + website (known after apply)
22:34:02.957 STDOUT terraform:     }
22:34:02.957 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
22:34:02.957 STDOUT terraform: 
22:34:02.957 STDOUT terraform: Changes to Outputs:
22:34:02.957 STDOUT terraform:   + apphub_service_uri         = {
22:34:02.957 STDOUT terraform:       + location    = "us-central1"
22:34:02.957 STDOUT terraform:       + service_id  = "eitch-demo-atlantis-terragrunt-testing-iac"
22:34:02.957 STDOUT terraform:       + service_uri = (known after apply)
22:34:02.957 STDOUT terraform:     }
22:34:02.957 STDOUT terraform:   + bucket                     = {
22:34:02.957 STDOUT terraform:       + autoclass                   = [
22:34:02.957 STDOUT terraform:           + {
22:34:02.957 STDOUT terraform:               + enabled                = false
22:34:02.957 STDOUT terraform:               + terminal_storage_class = (known after apply)
22:34:02.957 STDOUT terraform:             },
22:34:02.957 STDOUT terraform:         ]
22:34:02.957 STDOUT terraform:       + cors                        = []
22:34:02.957 STDOUT terraform:       + custom_placement_config     = []
22:34:02.957 STDOUT terraform:       + default_event_based_hold    = null
22:34:02.957 STDOUT terraform:       + effective_labels            = {
22:34:02.957 STDOUT terraform:           + goog-terraform-provisioned = "true"
22:34:02.957 STDOUT terraform:           + owner                      = "infrastructure"
22:34:02.957 STDOUT terraform:           + service-name               = "testing-iac"
22:34:02.958 STDOUT terraform:         }
22:34:02.958 STDOUT terraform:       + enable_object_retention     = null
22:34:02.958 STDOUT terraform:       + encryption                  = []
22:34:02.958 STDOUT terraform:       + force_destroy               = true
22:34:02.958 STDOUT terraform:       + hierarchical_namespace      = []
22:34:02.958 STDOUT terraform:       + id                          = (known after apply)
22:34:02.958 STDOUT terraform:       + ip_filter                   = []
22:34:02.958 STDOUT terraform:       + labels                      = {
22:34:02.958 STDOUT terraform:           + owner        = "infrastructure"
22:34:02.958 STDOUT terraform:           + service-name = "testing-iac"
22:34:02.958 STDOUT terraform:         }
22:34:02.958 STDOUT terraform:       + lifecycle_rule              = []
22:34:02.958 STDOUT terraform:       + location                    = "US-CENTRAL1"
22:34:02.958 STDOUT terraform:       + logging                     = []
22:34:02.958 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
22:34:02.958 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
22:34:02.958 STDOUT terraform:       + project_number              = (known after apply)
22:34:02.958 STDOUT terraform:       + public_access_prevention    = "inherited"
22:34:02.958 STDOUT terraform:       + requester_pays              = null
22:34:02.958 STDOUT terraform:       + retention_policy            = []
22:34:02.958 STDOUT terraform:       + rpo                         = (known after apply)
22:34:02.959 STDOUT terraform:       + self_link                   = (known after apply)
22:34:02.959 STDOUT terraform:       + soft_delete_policy          = [
22:34:02.959 STDOUT terraform:           + {
22:34:02.959 STDOUT terraform:               + effective_time             = (known after apply)
22:34:02.959 STDOUT terraform:               + retention_duration_seconds = 604800
22:34:02.959 STDOUT terraform:             },
22:34:02.959 STDOUT terraform:         ]
22:34:02.959 STDOUT terraform:       + storage_class               = "REGIONAL"
22:34:02.959 STDOUT terraform:       + terraform_labels            = {
22:34:02.959 STDOUT terraform:           + goog-terraform-provisioned = "true"
22:34:02.959 STDOUT terraform:           + owner                      = "infrastructure"
22:34:02.959 STDOUT terraform:           + service-name               = "testing-iac"
22:34:02.959 STDOUT terraform:         }
22:34:02.959 STDOUT terraform:       + time_created                = (known after apply)
22:34:02.959 STDOUT terraform:       + timeouts                    = null
22:34:02.959 STDOUT terraform:       + uniform_bucket_level_access = true
22:34:02.959 STDOUT terraform:       + updated                     = (known after apply)
22:34:02.959 STDOUT terraform:       + url                         = (known after apply)
22:34:02.959 STDOUT terraform:       + versioning                  = [
22:34:02.959 STDOUT terraform:           + {
22:34:02.959 STDOUT terraform:               + enabled = false
22:34:02.959 STDOUT terraform:             },
22:34:02.959 STDOUT terraform:         ]
22:34:02.959 STDOUT terraform:       + website                     = (known after apply)
22:34:02.960 STDOUT terraform:     }
22:34:02.960 STDOUT terraform:   + name                       = "eitch-demo-atlantis-terragrunt-testing-iac"
22:34:02.960 STDOUT terraform:   + url                        = (known after apply)
22:34:02.960 STDOUT terraform: 
22:34:02.960 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
22:34:02.960 STDOUT terraform: Saved the plan to:
22:34:02.960 STDOUT terraform: ./default.tfplan
22:34:02.960 STDOUT terraform: To perform exactly these actions, run the following command to apply:
22:34:02.960 STDOUT terraform:     terraform apply "./default.tfplan"
22:34:03.014 INFO   Shutting down Terragrunt Cache server...
22:34:03.019 INFO   Terragrunt Cache server stopped

22:34:03.086 INFO   Terragrunt Cache server is listening on 127.0.0.1:33095
22:34:03.086 INFO   Start Terragrunt Cache server
22:34:03.810 INFO   Shutting down Terragrunt Cache server...
22:34:03.810 INFO   Terragrunt Cache server stopped
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed